# Rebar Crank Type Utils Get All Rebar Crank Types Method

Source: https://www.revitapidocs.com/2026/b57660d4-da60-f69e-bd26-3909dae0c6c1.htm

---

| Rebar Crank Type Utils Get All Rebar Crank Types Method |
| --- |

Gets all the Rebar Crank Types elements from the document.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IList<ElementId> GetAllRebarCrankTypes(
	Document document
)
```

```
Public Shared Function GetAllRebarCrankTypes (
	document As Document
) As IList(Of ElementId)
```

```
public:
static IList<ElementId^>^ GetAllRebarCrankTypes(
	Document^ document
)
```

```
static member GetAllRebarCrankTypes :
        document : Document -> IList<ElementId>
```

#### Parameters

document Document
:   The document.

#### Return Value

IList ElementId
Returns all the Rebar Crank Types elements from the document. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

Remarks Internally this function is returning all element ids from a FilteredElementCollector of category BuiltInCategory.OST\_RebarCrankType. See Also

#### Reference

RebarCrankTypeUtils Class Autodesk.Revit.DB.Structure Namespace